<template>
  <div class="about-container">
    <img
      src="@/assets/img.webp"
      alt="Моя фотография"
      width="200"
      height="200"
      style="border-radius: 50%; object-fit: cover"
    />

    <h1>Акбар Мовлонов</h1>
    <p>21 лет | 16 июля 2003 год</p>
    <p>г. Ташкент, Алмазарский р-н</p>

    <h2>Информация</h2>
    <p>
      Учился в Ташкентском государственном техническом университете имени Ислама Каримова. Работал в
      компании Megawatt, где занимался поддержкой и автоматизацией процессов для зарядных станций и
      IT-систем.
    </p>
    <p>
      Реализовал проекты по текущему стеку технологий: InstaClone на React, Vite, Appwrite,
      TypeScript, Zod и React Hook Form с полной системой аутентификации; погодное приложение;
      простую игру на чистом JavaScript с использованием ООП — "Beatmaker"; а также телеграм-бот,
      который уведомляет о переходе зарядных станций в офлайн-статус.
    </p>

    <h2>О себе</h2>
    <p>
      Люблю смотреть фильмы и изучать языки в свободное время. Мне нравится автоматизировать рутину,
      но ещё больше — создавать полезные решения вместе с людьми и общаться в процессе.
    </p>
  </div>
</template>

<style scoped>
.about-container {
  max-width: 600px;
  margin: auto;
  padding: 20px;
  text-align: center;
}
</style>
